tbennett0/bsides-lilygo-passport/labs/01-trust-keyboard/sdkconfig.defaults
# Target: ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# Flash: 16MB on T-Dongle-S3
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y

# USB: enable TinyUSB HID device (count=1 enables the class)
CONFIG_TINYUSB_HID_COUNT=1

# Main task stack: TinyUSB needs headroom
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
